#+title:      Fundamentos de Probabilidade e Estatística para Ciência de Dados
#+date:       [2026-04-06 Mon 20:01]
#+filetags:   :courses:datascience:lecture:probest:
#+identifier: 20260406T200142
#+PROPERTY:header-args python :results output drawer :eval never-export :exports both

** Simulações
:PROPERTIES:
:header-args:python: :session *probs*
:END:


#+begin_src python
import random
import numpy as np

n = 20
urna = np.arange(1,n+1)
valor = 9
freq_evol = 0 # contador
freq_evolucao = []
ns = 2000

random.seed(123)

for i in range(1,ns + 1):
  ficha = random.choice(urna)
  if(ficha > valor):
    freq_evol = freq_evol + 1
  freq_evolucao.append(freq_evol / i)

print('Frequencia:', freq_evol/ns)
print('Probabilidade exata:', len(range(valor+1, n+1))/n)
#+end_src

#+RESULTS:
:results:
Frequencia: 0.5505
Probabilidade exata: 0.55
:end:

#+begin_src python :results output raw
import matplotlib.pyplot as plt

# Configurações do arquivo e dados
fig_lab = "./figs/convergencia_prob.pdf"
prob_exata = (n - valor) / n
simulacoes = np.arange(1, ns + 1)

# Geração do gráfico
plt.figure(figsize=(8, 5))
plt.plot(simulacoes, freq_evolucao, label="Simulada", color="blue", linewidth=1.5)
plt.axhline(y=prob_exata, label="Exata", color="red", linestyle="--", linewidth=2)

plt.xlabel("Número de Simulações")
plt.ylabel("Frequência Relativa")
plt.legend()
plt.tight_layout()

# Exportação conforme diretriz
plt.savefig(fig_lab)
plt.close()

print(f"[[file:{fig_lab}]]")
#+end_src

#+RESULTS:
[[file:./figs/convergencia_prob.pdf]]

** Probabilidade condicional
:LOGBOOK:
CLOCK: [2026-04-20 Mon 10:37]--[2026-04-20 Mon 11:29] =>  0:52
:END:

Seja o vetor aleatório bidimensional \((X,Y)\).
A probabilidade condicional de \(X = x\) dado que \(Y = y\) é dada por:

\[P(X = x, Y = y) = \frac{P(X = x, Y = y)}{P(Y = y)} \quad P(Y = y) > 0\]

Sendo assim, é a função de densidade de probabilidade conjunta dividida pela função de densidade marginal.

|    \(X_{1}, X_{2}\) | 0     | 1    | \(P(X_{1} = x)\) |
|             0 | 9/21  | 5/21 | 14/21         |
|             1 | 5/21  | 2/21 | 7/21          |
| \(P(X_{2} = x)\) | 14/21 | 7/21 | 1             |

Calculando que \(P(X_{1} = x | X_{2} = y)\), tem-se:

|                                     | X2 = 0     | X2 = 1    |
| \(P(X1 = 0  \text{ dado } X2 = x)\) | 9/21/14/21 | 5/21/7/21 |
| \(P(X1 = 1  \text{ dado } X2 = x)\) | 5/21/14/21 | 2/21/7/21 |


Para o caso contínuo, temos:

\[f_{X|Y}(x | Y = y) = \frac{f(x, y)}{f_Y(y)} \quad f_Y(y) > 0\]

Para uma situação em que \(X\) varia entre \([0,1]\), tem-se:
\[P(X \geq \frac12 | Y = y) = \int_{\frac12}^{1}f_{X|Y}(x|y)dx = \int_{\frac12}^{1} \frac{f(x,y)}{f_Y(y)} dx \]

*** Gereção de números aleatórios

No método chamada Linear Congruential Generator, nós geramos uma sequência de números pseudo-aleatórios através da relação de recorrência:
$$X_{n+1} = (aX_n + c) \mod m$$
onde $X_0$ é a semente, \(m\), \(a\) e \(c\) são inteiros maiores do que zero.
A sequência obtida satisfaz  $0 \leq X_i \leq m$.
Para gerar o número no intervalo [0,1], usamos $$U_n = X_n/m.$$

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt

# função para gerar os números aleatórios
def random(Xi, a, c, m):
    Xii = (a*Xi + c)%m
    return Xii

# constantes
a = 11; c = 0; m = 16
X0 = 1 # semente do gerador
n = 20 # quantidade de números a serem gerados
Xi = X0 # inicia a sequência de números
X = [X0] # armazena os números gerados
for i in range(n):
    Xi = random(Xi,a,c,m)
    X.append(Xi)
print(X)
# mostra a sequência gerada
s = np.arange(0, len(X))
plt.figure(figsize=(8,5))
plt.bar(s,X, color = 'gray')
plt.xlabel('n', fontsize = 20)
plt.ylabel('x',fontsize = 20)
plt.savefig('./figs/MC1.svg')
plt.show(True)
# mostra o histograma da sequência gerada
plt.figure(figsize=(8,5))
plt.hist(X, bins='auto', color = 'gray',
         histtype='bar', ec='black')
plt.xlabel('x', fontsize = 20)
plt.ylabel('P(x)',fontsize = 20)
plt.savefig('./figs/MC2.svg')
plt.show(True)
#+end_src

#+RESULTS:
:results:
[1, 11, 9, 3, 1, 11, 9, 3, 1, 11, 9, 3, 1, 11, 9, 3, 1, 11, 9, 3, 1]
:end:

Notamos que a sequência é periódica, sendo que $[1, 11, 9, 3]$ se repete.
Ou seja, não temos um bom gerador de números aleatórios, pois podemos prever o próximo número se descobrir a sequência.
Para resolver esse problema, temos o seguinte teorema, demonstrado no livro The Art Of Computer Programming (Donald Knuth).

O gerador pseudo-aleatório linear produz uma sequência aperiódica se as seguintes condições forem satisfeitas:
- \(X_{n+1}_{} = (aX_n + c)\mod m, \quad U_n = X_n/m.\)
- Se $q$ é um número primo que divide $m$, então ele divide $b=a-1$.
  - OBS: \(q\) não está definido ainda
- Se $m$ é múltiplo de 4, então $b=a-1$ deve ser múltiplo de 4.
- O único inteiro que divide exatamente $m$ e $c$ é  valor um.

Simulando com valores que satisfazem essas condições:

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt

# função que gera os números aleatórios
def random(Xi, a, c, m):
    Xii = (a*Xi + c)%m
    return Xii

# constantes
a = 7**5; c = 0; m = 2**31 - 1
X0 = 1 # semente do gerador
n = 500 # quantidade de números a serem gerados
Xi = 1 # inicia sequência
X = [X0] # armazena os números gerados
for i in range(n):
    Xi = random(Xi,a,c,m)
    X.append(Xi/m)
# mostra a sequência gerada
s = np.arange(0, len(X))
plt.figure(figsize=(8,5))
plt.bar(s,X, color = 'gray')
plt.xlabel('n', fontsize = 20)
plt.ylabel('u',fontsize = 20)
plt.savefig('.figs/MC3.svg')
plt.show(True)
# mostra o histograma da sequência gerada
plt.figure(figsize=(8,5))
plt.hist(X, bins='auto', color = 'gray',
         histtype='bar', ec='black',density='True')
plt.xlabel('u', fontsize = 20)
plt.ylabel('P(u)',fontsize = 20)
plt.savefig('.figs/MC4.svg')
plt.show(True)
#+end_src

#+RESULTS:
:results:
:end:

Sendo assim, foi possível gerar números aleatórios que seguem uma distribuição próxima à uniforme.
A partir disso, tem-se um gerador de números aleatórios para gerar outras simulações e distribuições.
Partindo de um caso que tem uma urna com bolas brancas e pretas, existem formas complementares de realizar o experimento.
É possível fazer um sorteio uniforme em que se o valor obtido for menor do que \(p\) (proporção de brancas), então a bola sorteada é branca; preta caso contrário.

#+begin_src python
import random
import numpy as np
import matplotlib.pyplot as plt
# inicia a semente do gerador aleatório
np.random.seed(10)

vp = [] # lista que armazena a fração de ocorrências
vsim = [] # armazena o número de simulações
Nmax = 1000 # numero máximo de simulações
p = 0.6 # probabilidade de sair uma bola branca
for nsim in np.arange(1,Nmax,1):
    n = 0 # número de bolas brancas retiradas
    for i in range(1,nsim):
        if(np.random.uniform(0,1)<p):
            # se o valor sorteado é menor do que p
            n = n + 1
    vp.append(n/nsim)
    vsim.append(nsim)

plt.figure(figsize=(8,6))
plt.plot(vsim, vp, linestyle='-', color="gray",
         linewidth=2,label = 'Valor simulado')
plt.axhline(y=p, color='black', linestyle='--',
            label = 'Valor teórico')
plt.ylabel("Fração de bolas brancas", fontsize=20)
plt.xlabel("Número de simulações", fontsize=20)
plt.xlim([0.0, Nmax])
plt.ylim([0.0, 1.0])
plt.legend(fontsize=15)
plt.savefig('./figs/sim1_MC.svg')
plt.show(True)
#+end_src

#+RESULTS:
:results:
:end:

Esse tipo de raciocínio pode ser extendido para mais de \(n\) categorias, sempre sorteando um valor aleatório a partir de uma distribuição uniforme e compara com a probabilidade teórica.

Outro tipo de aplicação é o cálculo do valor de \(\pi\) em que a probabilidade é definida em termos da porcentagem da área de um círculo em relação à área do quadrado que o sobrescreve.
Essa probabilidade será de \(\pi/4\).
Neste caso, pertencer ao círculo, tem-se \(P(X^{2} + Y^{2} < R^{2})\)

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt

R = 1
x = np.linspace(-R, R, 100)
y = np.linspace(-R, R, 100)
X, Y = np.meshgrid(x,y)
F = X**2 + Y**2 - 1
plt.figure(figsize=(6,6))
plt.contour(X,Y,F,[0])
plt.grid(True)

# Seleciona pontos aleatórios
for i in range(0,1000):
    x = np.random.uniform(-1,1)
    y = np.random.uniform(-1,1)
    if(x**2 + y**2 < R**2):
        plt.plot(x,y,'o', color="gray")
    else:
        plt.plot(x,y,'o', color="black")
plt.savefig("./figs/pi_approx_mc.svg")
plt.show()
#+end_src

#+RESULTS:
:results:
:end:

#+begin_src python
n = 10000
count_inside = 0
for i in np.arange(0,n):
    x = np.random.uniform(-1,1)
    y = np.random.uniform(-1,1)
    if( x**2 + y**2 < 1):
        count_inside = count_inside + 1
pi = 4*count_inside/n
print("Value of pi:", pi)
#+end_src

#+RESULTS:
:results:
Value of pi: 3.15104
:end:

** Cálculo de integrais

Podemos calcular integrais numericamente usando números aleatórios.
Temos:
$\theta = \int_{0}^{1} g(u)du = \int_{0}^{1} 1\cdot g(u)du = \int_{0}^{1} f(u) g(u)du = E[g(U)]$
onde $U$ tem distribuição uniforme em $[0,1]$:
\begin{equation}
f(u) =
\begin{cases}
1, \quad 0 \leq u \leq 1\\
0 \quad \mbox{caso contrário}.
\end{cases}
\end{equation}

Assim, podemos calcular $\theta$ numericamente:
$\lim_{n \rightarrow \infty} \sum_{i=1}^{n}\frac{g(U_i)}{n} = E[g(U)] = \theta$

Sendo assim, a integral é numericamente aproximada de uma soma que considera números aleatórios.
Vamos considerar um exemplo: $\theta = \int_{0}^{1}(x+1)dx = 1.5$

#+begin_src python
import numpy as np
# função a ser integrada
def g(x):
    f = x + 1
    return f
n = 1000 # número de valores sorteados
theta = 0
for i in range(n):
    # sorteia um valor uniformemente em [0,1]
    u = np.random.uniform(0,1)
    theta = theta + g(u)
# calcula a média de theta
theta = theta/n
print("Integral: ", theta)
#+end_src

#+RESULTS:
:results:
Integral:  1.495987295919095
:end:

No caso geral, temos as seguinte integral:
$\theta = \int_{a}^{b} g(u) du$
se fizermos $y = \frac{u-a}{b-a}$, temos $du = (b-a)dy$.
Basicamente, faz-se a troca de variáveis de modo à fazer a normalização min-max dos limites da integral, retornando ao caso anterior.
Assim,
$\theta = \int_{a}^{b} g(u) du = \int_{0}^{1} g[(b-a)y + a](b-a) dy = \int_{0}^{1} h(y) dy$,
onde $h(y) = (b-a)g[(b-a)y + a]$.
$\theta = E[h(Y)]$.
Vamos considerar um exemplo:
$\theta = \int_{2}^{4}(x+1)dx = 8$

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt

# função a ser integrada
def g(x):
    g = x + 1
    return g

def h(y,a,b):
    val = (b-a)*g(a+(b-a)*y)
    return val

valor_teorico = 8
a = 2; b = 4 # limites de integração
Nmax = 1000 # número máximo de simulacoes
vtheta = []
vn = []
for n in range(1,Nmax):
    theta = 0
    for i in range(n):
        u = np.random.uniform(0,1)
        # calcula theta
        theta = theta + h(u,a,b)
    # calcula o valor médio de theta
    theta = theta/n
    vtheta.append(theta)
    vn.append(n)
# mostra os resultados
plt.figure(figsize=(8,6))
plt.plot(vn, vtheta, linestyle='-', color="gray",
         linewidth=2,label = 'Valor simulado')
plt.axhline(y=valor_teorico, color='black',
            linestyle='--', label = 'Valor teórico')
plt.ylabel('E[g(U)]', fontsize=20)
plt.xlabel("Número de simulações", fontsize=20)
plt.legend(fontsize = 15)
plt.savefig("./figs/Int2_MC.svg")
plt.show(True)
#+end_src

#+RESULTS:
:results:
:end:

No caso em que um dos limites de integração é infinito, procedemos da seguinte maneira:
$\theta = \int_{0}^{\infty} g(u) du$
definindo: $y = 1/(x+1)$ temos $dy = y^2 dx$.
Então
$\theta = \int_{0}^{\infty} g(u) du = \int_{0}^{1}g(\frac{1}{y} - 1)\frac{dy}{y^2} = \int_{0}^{1}h(y)dy$
onde
$h(y) = \frac{g(1/y-1)}{y^2}$
$\theta = E[h(Y)]$.

Vamos calcular:
$\theta = \int_{0}^{\infty} e^{-x}dx = 1$

#+begin_src python
import random
import numpy as np
import matplotlib.pyplot as plt

# função a ser integrada
def g(x):
    f = np.exp(-x)
    return f

def h(y):
    val = g(1/y -1)/y**2
    return val

valor_teorico = 1
Nmax = 1000 # número máximo de simulações
vtheta = []
vn = []
# realiza a simulação
for n in range(1,Nmax):
    theta = 0
    for i in range(n):
        u = np.random.uniform(0,1)
        # calcula theta
        theta = theta + h(u)
    # calcula o valor médio de theta
    theta = theta/n
    vtheta.append(theta)
    vn.append(n)
# mostra os resultados
plt.figure(figsize=(8,6))
plt.plot(vn, vtheta, linestyle='-', color="gray",
         linewidth=2,label = 'Valor simulado')
plt.axhline(y=valor_teorico, color='black',
            linestyle='--', label = 'Valor teórico')
plt.ylabel('E[g(U)]', fontsize=20)
plt.xlabel("Número de simulações", fontsize=20)
plt.legend(fontsize = 15)
plt.savefig("./figs/int3_MC.svg")
plt.show(True)
#+end_src

#+RESULTS:
:results:
:end:

** Simulando variáveis aleatórias

Seja \(X\) uma variável aleatória com função de distribuição acumulada \(F_{X}(X) = P(X \leq x)\) em que \(F_{X}\) é estritamente não-decrescente.
Se, \(u \leq F_{X}(x) \leftrightarrow F^{-1}(u) \leq x\) em que \(F^{-1}\) existe.
Para encontrar a variável aleatória \(Y = F^{-1}_{X}(U)\) que tem a mesma distribuição que \(X\) e \(U\) tem distribuição uniforme.
Se \(F_{x}(x) = u\), então:

\[P( Y \leq x ) = F_{x}(x)\]

Somente se a inversa \(Y = F^{-1}_{X}(U)\) tiver a mesma distriuição que \(X\).

Para simular uma variável aleatória \(X\), gera-se \(n\) valores que seguem uma distribuição uniforme e calcula-se:

\[x_{i} = F^{-1}_{x}(u_i)\]

Ou seja, calcula-se o inverso sa distribuição acumulada de \(X\) (\(F_{X}(X) = P(X \leq x)\)).
Ao repetir esse valor \(n\) vezes, obtém-se \(n\) valores de \(X\).

Aplicando para o caso em que \(X\) segue uma distribuição exponencial e encontrando sua função acumulada inversa:

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt

lbd = 2 # parâmetro do modelo exponencial
n = 1000 # número de valores gerados
X = [] # lista que armazena os valores
for i in range(0,n):
    u = np.random.uniform(0,1)
    x = -(1/lbd)*np.log(1 - u)
    X.append(x)
# mostra a distribuição dos dados gerados
plt.figure(figsize=(8,5))
plt.hist(X, bins='auto', color = 'lightgray',
         histtype='bar', ec='black',density = True)
# mostra a curva teórica
y = np.linspace(0, np.max(X), 100)
f = lbd*np.exp(-lbd*y)
plt.plot(y,f,'--', color = 'black')
plt.xlabel('x', fontsize = 20)
plt.ylabel('f(x)',fontsize = 20)
plt.savefig('./figs/MC-exp.svg')
plt.show(True)
#+end_src

#+RESULTS:
:results:
:end:

Em que o histograma apresenta uma aproximação de uma função densidade de probabilidade.

*Exemplo:* Simule a distribuição a seguir usando o método da transformação inversa:
$$
f(x) = \begin{cases}
3x^2, \quad 0 < x  <1,\\
0, \quad \text{caso contrário.}
\end{cases}
$$
A distribuição acumulada de $X$:
$$
F_X(x) = \int_{-\infty}^x 3s^2ds = \int_{0}^x 3s^2ds = x^3.
$$
Logo, a inversa da distribuição acumulada:
$$
\begin{aligned}
x &= F_X^{-1}(u)\\
F(x) &= F_X(F_X^{-1}(u))\\
x^3 &= u\\
x  &= u^{1/3}.
\end{aligned}
$$

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt

n = 1000 # número de valores gerados
X = [] # armazena os valores
for i in range(0,n):
    u = np.random.uniform(0,1)
    x = u**(1/3)
    X.append(x)
# mostra a distribuição dos dados gerados
plt.figure(figsize=(8,5))
plt.hist(X, bins='auto', color = 'lightgray',
         histtype='bar', ec='black',density = True)
# mostra a curva teórica
y = np.linspace(0, np.max(X), 100)
f = 3*y**2
plt.plot(y,f,'--', color = 'black')
plt.xlabel('x', fontsize = 20)
plt.ylabel('f(x)',fontsize = 20)
plt.show()
#+end_src

#+RESULTS:
:results:
:end:

** Correlação

Vamos considerar alguns casos para vermos como se comporta o coeficiente de correlação de Pearson de acordo com diferentes tendências entre as variáveis $X$ e $Y$.

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt
from scipy.stats import pearsonr
np.random.seed(13)

# Generate data from a normal distribution
N = 100
X = np.random.normal(0, 1, N)  # Mean 0, standard deviation 1

for sigma in np.arange(0, 6, 1):
    error = np.random.normal(0, sigma, N)
    Y = 2 * X + error
    corr, p_value = pearsonr(X, Y)

    plt.figure(figsize=(8, 4))
    plt.xlim(-3.5,3.5)
    plt.ylim(-13,13)
    plt.plot(X, Y, 'o', color='gray', markersize=8,
             markerfacecolor='gray',
             markeredgecolor='black')
    plt.xlabel("X", fontsize=15)
    plt.ylabel("Y", fontsize=15)
    corr = int(corr * 100) / 100
    string = 'corr = ' + str(corr) + '\nsigma = ' + str(sigma)
    plt.text(-3,8, string, fontsize=15)
    plt.show()
#+end_src

#+RESULTS:
:results:
:end:

Na medida que a dispersão aumenta, a correlação de Pearson diminui.

Quando existe mais do que uma variável, pode-se utilizar uma matriz de correlação (feita par a par).

#+begin_src python
import pandas as pd
import matplotlib.pyplot as plt

csv_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
col_names = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Class']
data =  pd.read_csv(csv_url, names = col_names)

# remove a última coluna
data = data.drop(data.columns[-1],axis=1)
corr = data.corr()
#Plot Correlation Matrix using Matplotlib
plt.figure(figsize=(7, 5))
plt.imshow(corr, cmap='Blues', interpolation='none', aspect='auto')
plt.colorbar()
plt.xticks(range(len(corr)), corr.columns, rotation='vertical')
plt.yticks(range(len(corr)), corr.columns);
plt.suptitle('Correlation between variables', fontsize=15, fontweight='bold')
plt.grid(False)
plt.show()
#+end_src

#+RESULTS:
:results:
:end:

Também é possível combinar um gráfico de dispersão com as respectivas distribuições (via método de Kernel).

#+begin_src python
import seaborn as sns
sns.pairplot(data,
                 markers="+",
                 diag_kind="kde",
                 kind='reg',
                 plot_kws={'line_kws':{'color':'#aec6cf'},
                           'scatter_kws': {'alpha': 0.7,
                                           'color': 'red'}},
                 corner=True);
plt.show()
#+end_src

#+RESULTS:
:results:
:end:

Esses dados permitem visualizar o [[denote:20260428T101440][Simpson's Paradox]].

Já a correlação de Spearman que usa a ordenação das variáveis invés dos dados brutos.
Depois, calcula-se o coeficiente de Pearson entre os dados ordenados.
Como consequência, é mais robusto à outliers.
Sendo assim, a correlação de Spearman mede relação de crescimento.
Logo, Spearman mede uma relação monotônica enquanto Pearson mede uma relação linear.

#+begin_src python
import numpy as np
import matplotlib.pyplot as plt
from scipy.stats import pearsonr, spearmanr

N = 100
x = np.linspace(1, 50000, N)
z = np.log(x)

plt.plot(x, z)
plt.xlabel("x",fontsize = 20)
plt.ylabel("Log(X)", fontsize = 20)
corr, p_value = pearsonr(x, z)
corrs, p_values = spearmanr(x, z)
corr = int(corr*100)/100
corrs = int(corrs*100)/100
string = 'Pearson corr. = '+ str(corr)
plt.text(20000,3, string, fontsize=15)
string = 'Spearman corr. = '+ str(corrs)
plt.text(20000,1, string, fontsize=15)
plt.show()
print("Pearson:",corr)
print("Spearman:",corrs)
#+end_src

#+RESULTS:
:results:
Pearson: 0.72
Spearman: 0.99
:end:

** Análise de componentes principais

Parte-se da matriz de covariância dos dados para então diagonalizá-la usando o método SVD.
O resultado é uma matriz de covariância diagonal.
Para tanto, calcula-se os autovalores dessa matriz diagonal de modo que os respectivos autovetores (ordenados) serão os novos eixos ortogonais.
Multiplicando os valores originais pelos respectivos autovetores, obtém-se a projeção desses dados nos novos eixos.

#+begin_src python
import numpy as np

def pca_matrix_diagonalization(X, n_components):
    # Calculate the covariance matrix
    covariance_matrix = np.cov(X, rowvar=False)

    # Calculate eigenvalues and eigenvectors
    eigenvalues, eigenvectors = np.linalg.eig(covariance_matrix)

    # Sort eigenvalues and eigenvectors in descending order
    sorted_indices = np.argsort(eigenvalues)[::-1]
    eigenvalues = eigenvalues[sorted_indices]
    eigenvectors = eigenvectors[:, sorted_indices]

    # Select the top n_components eigenvectors
    principal_components = eigenvectors[:, :n_components]

    # Project the data onto the principal components
    projected_data = X @ principal_components

    return projected_data, eigenvalues, eigenvectors

import pandas as pd
from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA
import matplotlib.pyplot as plt
import numpy as np

csv_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
col_names = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Class']
data =  pd.read_csv(csv_url, names = col_names)

# Prepare the data
data = data.to_numpy()
nrow, ncol = data.shape
y = data[:, -1]
X = data[:, 0:ncol - 1]

# Standardize the features
scaler = StandardScaler().fit(X)
X_scaled = scaler.transform(X)

# Project the data using pca_matrix_diagonalization
projected_data, eigenvalues, eigenvectors = pca_matrix_diagonalization(X_scaled, 2)

# Visualize the projected data
plt.figure(figsize=(6, 4))
for label in np.unique(y):
    plt.scatter(projected_data[y == label, 0], projected_data[y == label, 1], label=label, s=50)
plt.xlabel("First Component", fontsize=15)
plt.ylabel("Second Component", fontsize=15)
plt.xticks(color='k', size=10)
plt.yticks(color='k', size=10)
plt.legend()
plt.show()

#+end_src

#+RESULTS:
:results:
:end:

Usando as bibliotecas do python:

#+begin_src python
import matplotlib.pyplot as plt
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler

# Assuming 'data' is your DataFrame as in the provided code
# and X and y are already defined (features and classes)

# Standardize the features
scaler = StandardScaler().fit(X)
X_scaled = scaler.transform(X)

# Apply PCA
pca = PCA(n_components=2)
pca_result = pca.fit_transform(X_scaled)

# Create the scatter plot, coloring by class
plt.figure(figsize=(6, 4))
for label in np.unique(y):
    plt.scatter(pca_result[y == label, 0], pca_result[y == label, 1], label=label, s=50)
plt.xlabel("First Component", fontsize=15)
plt.ylabel("Second Component", fontsize=15)
plt.xticks(color='k', size=10)
plt.yticks(color='k', size=10)
plt.legend()
# plt.show()

pca = PCA().fit(X)
plt.figure(figsize=(6,4))
ncomp = np.arange(1, np.shape(X)[1]+1)
# mostra a variância acumulada
plt.plot(ncomp, np.cumsum(pca.explained_variance_ratio_), 'ro-')
plt.xlabel('number of components', fontsize=15)
plt.ylabel('cumulative explained variance', fontsize=15);
plt.xticks(color='k', size=10)
plt.yticks(color='k', size=10)
plt.grid(True)
plt.show()
#+end_src

#+RESULTS:
:results:
:end:

